Julianiolo/ATmega32u4_Emulator/src/extras/Disassember.cpp
#include "Disassembler.h"

#include <algorithm>
#include <fstream>
#include <streambuf>
#include <iostream>
#include <chrono>

#include "StringUtils.h"
#include "DataUtils.h"

#include "../ATmega32u4.h"

#include "../components/InstInds.h"
#include "../components/InstHandler.h"

#define MCU_MODULE "Disassembler"

#define INST_PAR_TYPE_RAWVAL 0
#define INST_PAR_TYPE_RAWVALDEC 1
#define INST_PAR_TYPE_REG 2
#define INST_PAR_TYPE_ADDR 3
#define INST_PAR_TYPE_OFFSET 4
#define INST_PAR_TYPE_OFFSET16 5
#define INST_PAR_TYPE_REG_OFFSET 6

size_t A32u4::Disassembler::DisasmFile::BranchRoot::addrDist() const {
	return std::max(start,dest) - std::min(start,dest);
}


A32u4::Disassembler::DisasmFile::DisasmFile(){

}
void A32u4::Disassembler::DisasmFile::addDisasmData(size_t size){
	disasmData = std::make_shared<DisasmData>(size);
}
const A32u4::Disassembler::DisasmFile::DisasmData* A32u4::Disassembler::DisasmFile::getDisasmData() const {
	return disasmData.get();
}

bool A32u4::Disassembler::DisasmFile::addrIsActualAddr(addrmcu_t addr) {
	return addr != Addrs_notAnAddr && addr != Addrs_symbolLabel;
}
bool A32u4::Disassembler::DisasmFile::addrIsNotProgram(addrmcu_t addr) {
	return addr == Addrs_notAnAddr;
}
bool A32u4::Disassembler::DisasmFile::addrIsSymbol(addrmcu_t addr) {
	return addr == Addrs_symbolLabel;
}

void A32u4::Disassembler::DisasmFile::loadSrc(const char* str, const char* strEnd) {
	if (strEnd == NULL)
		strEnd = str + std::strlen(str);

	content = std::string(str, strEnd);
	processContent();
}

bool A32u4::Disassembler::DisasmFile::loadSrcFile(const char* path) {
	bool success = false;
	content = StringUtils::loadFileIntoString(path, &success);

	if (!success)
		return false;

	processContent();
	return true;
}

void A32u4::Disassembler::DisasmFile::generateContent(const Flash* data, const AdditionalDisasmInfo& info){
	content.clear();
	MCU_ASSERT(disasmData);
	
	std::sort(disasmData->lines.begin(), disasmData->lines.end(), [](const DisasmData::Line& a, const DisasmData::Line& b) {
		return a.addr < b.addr;
	});

	addrmcu_t nextDataAddr = -1;
	size_t dataSymbInd = 0;
	if(info.numOfDataSymbols > 0)
		nextDataAddr = (addrmcu_t)info.dataSymbol(0).value;

	addrmcu_t lastAddr = 0;
	for (size_t i = 0; i < disasmData->lines.size(); i++){
		auto& line = disasmData->lines[i];

		// draw data blocks
		while(nextDataAddr != (addrmcu_t)-1 && line.addr*2 > nextDataAddr){
			auto dataSymb = info.dataSymbol(dataSymbInd);
			content += StringUtils::format("\n%08x <%s>:\n", dataSymb.value, dataSymb.name.c_str()); //symbol label

			for(size_t i = 0; i<dataSymb.size; i+=16){
				std::string bytes;
				for(size_t j = 0; j<std::min((size_t)16,dataSymb.size-i); j++){
					uint8_t byte = data->getByte((addrmcu_t)(dataSymb.value+i+j));
					bytes += StringUtils::uIntToHexStr(byte, 2);
					bytes += ' ';
				}

				std::string ascii;
				for(size_t j = 0; j<std::min((size_t)16,dataSymb.size-i); j++){
					char byte = data->getByte((addrmcu_t)(dataSymb.value+i+j));
					if(!StringUtils::isprint(byte)) byte = '.';
					ascii += byte;
				}

				// bytes padd amt = (2+1)*16=48
				content += StringUtils::format(
					"%8x:\t%-48s    %s\n",
					dataSymb.value+i, bytes.c_str(), ascii.c_str()
				);
			}

			dataSymbInd++;
			if(dataSymbInd >= info.numOfDataSymbols) {
				nextDataAddr = -1;
			}else{
				nextDataAddr = (addrmcu_t)info.dataSymbol(dataSymbInd).value;
			}
			content += "\n";

			lastAddr = (addrmcu_t)(dataSymb.value + dataSymb.size);
		}

		if (line.addr - lastAddr > 512) // make big gaps in program stand out
			content += "\n     ...\n\n";

		if (info.getSymbolNameFromAddr) {
			std::string name;
			if (info.getSymbolNameFromAddr(line.addr*2, false, &name)) {
				content += StringUtils::format("\n%08x <%s>:\n", line.addr*2, name.c_str());
				goto skip;
			}
		}
		if (disasmData.get()->funcCalls.find(line.addr) != disasmData.get()->funcCalls.end()) {
			// has a function
			content += StringUtils::format("\n%08x <func@%x>:\n", line.addr*2, line.addr*2);
		}
		skip:
			

		if (info.getLineInfoFromAddr != nullptr) {
			std::string add;
			if (info.getLineInfoFromAddr(line.addr * 2, &add))
				content += add + "\n";
		}

		content += line.str + "\n";

		switch(line.inst_ind){
			case IND_RET:
				MCU_FALLTHROUGH;
			case IND_RETI:
				content += "\n";
				break;
		}

		lastAddr = line.addr;
	}
	
	processContent();
}

void A32u4::Disassembler::DisasmFile::disassembleBinFile(const Flash* data, const AdditionalDisasmInfo& info){
	if (!data->isProgramLoaded()) {
		MCU_LOG_(ATmega32u4::LogLevel_Error, "Could not disassemble because no program is loaded!");
		content = "";
		return;
	}

	auto start = std::chrono::high_resolution_clock::now();

	if(!disasmData)
		addDisasmData(data->sizeWords());
	for(addrmcu_t i = 0; i <= 0xa8;i+=4)
		disasmRecurse(i/2,data, disasmData.get());

	if (info.analytics) {
		for(size_t i = 0; i < std::min(data->sizeWords(), Analytics::PCHeatArrSize); i++){
			if(info.analytics->getPCHeat()[i] > 0 && !disasmData.get()->disasmed.get(i))
				disasmRecurse((pc_t)i, data, disasmData.get());
		}
	}

	for(size_t i = 0; i<info.additionalDisasmSeeds.size(); i++) {
		disasmRecurse(info.additionalDisasmSeeds[i], data, disasmData.get());
	}

	auto end0 = std::chrono::high_resolution_clock::now();
	{
		double ms = std::chrono::duration_cast<std::chrono::microseconds>(end0 - start).count()/1000.0;
		MCU_LOGF_(ATmega32u4::LogLevel_DebugOutput, "walking program took %f ms", ms);
	}


	generateContent(data,info);

	auto end = std::chrono::high_resolution_clock::now();
	{
		double ms = std::chrono::duration_cast<std::chrono::microseconds>(end - start).count()/1000.0;
		MCU_LOGF_(ATmega32u4::LogLevel_DebugOutput, "disassembly in total took %f ms", ms);
	}
}

uint16_t A32u4::Disassembler::DisasmFile::generateAddrFromLine(const char* start, const char* end) {
	if (start + 8 > end || *start != ' ' || start[8] != ':') {
		if (*start == '0' && start[8] == ' ' && isValidHexAddr(start,start+8))
			return Addrs_symbolLabel;
		else
			return Addrs_notAnAddr;
	}

